fasmide/esp32_calthing/esp32ui/src/main.cpp
  if (!app.pullRefreshArmed || agenda_panel == nullptr || app.fetchInProgress || app.pullRefreshInProgress) {
    return;
  }

  app.pullRefreshArmed = false;
  app.pullRefreshInProgress = true;
  app.refreshRequested = true;
  setStatus("Refreshing source", true);
  setRefreshOverlay("Refreshing calendar...", true);
}

void onBackPressed(lv_event_t *e) {
  LV_UNUSED(e);
  if (agenda_panel == nullptr) {
    return;
  }

  lv_obj_scroll_to_y(agenda_panel, 0, LV_ANIM_ON);
  hideDetailOverlay();
}

void initStyles() {
  lv_style_init(&style_screen);
  lv_style_set_bg_color(&style_screen, lv_color_hex(0x07111D));
  lv_style_set_text_color(&style_screen, lv_color_hex(0xF4F7FB));

  lv_style_init(&style_day_panel);
  lv_style_set_bg_opa(&style_day_panel, LV_OPA_TRANSP);
  lv_style_set_border_width(&style_day_panel, 0);
  lv_style_set_radius(&style_day_panel, 0);
  lv_style_set_pad_all(&style_day_panel, 8);

  lv_style_init(&style_event_card);
  lv_style_set_bg_color(&style_event_card, lv_color_hex(0x102033));
  lv_style_set_border_width(&style_event_card, 1);
  lv_style_set_border_color(&style_event_card, lv_color_hex(0x2E4B74));
  lv_style_set_radius(&style_event_card, 0);
  lv_style_set_pad_hor(&style_event_card, 10);
  lv_style_set_pad_ver(&style_event_card, 8);
  lv_style_set_text_color(&style_event_card, lv_color_hex(0xF4F7FB));

  lv_style_init(&style_modal);
  lv_style_set_bg_color(&style_modal, lv_color_hex(0x0E1A2D));
  lv_style_set_border_width(&style_modal, 1);
  lv_style_set_border_color(&style_modal, lv_color_hex(0x426389));
  lv_style_set_radius(&style_modal, 22);
  lv_style_set_pad_all(&style_modal, 18);

  lv_style_init(&style_fab);
  lv_style_set_bg_color(&style_fab, lv_color_hex(0x2B558C));
  lv_style_set_radius(&style_fab, LV_RADIUS_CIRCLE);
  lv_style_set_pad_hor(&style_fab, 18);
  lv_style_set_pad_ver(&style_fab, 12);
  lv_style_set_shadow_width(&style_fab, 0);

  lv_style_init(&style_status);
  lv_style_set_bg_color(&style_status, lv_color_hex(0x203653));
  lv_style_set_radius(&style_status, LV_RADIUS_CIRCLE);
  lv_style_set_pad_hor(&style_status, 12);
  lv_style_set_pad_ver(&style_status, 6);
}

void resetEvents() {
  app.eventCount = 0;
  for (int i = 0; i < APP_EVENT_CAPACITY; ++i) {
    app.events[i] = CalendarEvent();
  }
}

bool appendEvents(JsonArray events) {
  for (JsonObject item : events) {
    if (app.eventCount >= APP_EVENT_CAPACITY) {
      return false;
    }

    CalendarEvent &event = app.events[app.eventCount++];
    event.id = String(item["id"] | "");
    event.title = String(item["title"] | "(untitled)");
    event.description = String(item["description"] | "");
    event.location = String(item["location"] | "");
    event.startTs = item["start_ts"] | 0;
    event.endTs = item["end_ts"] | event.startTs;
    event.createdTs = item["created_ts"] | 0;
    event.allDay = item["all_day"] | false;
  }
  return true;
}

bool fetchAgendaWindow() {
  if (!app.wifiReady) {
    setStatus("Wi-Fi offline", true);
    setRefreshOverlay("", false);
    return false;
  }

  app.fetchInProgress = true;
  resetEvents();
  setStatus("Syncing calendar", true);

  String nextCursor;
  bool hasMore = false;
  int pageCount = 0;

  do {
    String url = String(APP_DAEMON_URL) + "/v1/events?from=" + urlEncode(formatRfc3339(app.rangeStart));
    url += "&to=" + urlEncode(formatRfc3339(app.rangeEnd));
    url += "&limit=" + String(APP_EVENT_PAGE_LIMIT);
    if (nextCursor.length() > 0) {
      url += "&cursor=" + urlEncode(nextCursor);
    }

    WiFiClient client;
    HTTPClient http;
    http.setConnectTimeout(8000);
    http.setTimeout(12000);

    if (!http.begin(client, url)) {
      setStatus("Request setup failed", true);
      setRefreshOverlay("", false);
      app.fetchInProgress = false;
      return false;
    }

    http.addHeader("Authorization", String("Bearer ") + APP_API_TOKEN);

    const int httpCode = http.GET();
    if (httpCode != HTTP_CODE_OK) {
      String errorText = http.errorToString(httpCode);
      http.end();
      setStatus("Fetch failed: " + errorText, true);
      setRefreshOverlay("", false);
      app.fetchInProgress = false;
      return false;
    }

    String payload = http.getString();
    http.end();

    DynamicJsonDocument doc(12288);
    DeserializationError error = deserializeJson(doc, payload);
    if (error) {
      setStatus("Bad daemon response", true);
      setRefreshOverlay("", false);
      app.fetchInProgress = false;
      return false;
    }

    app.lastSyncTs = doc["last_sync_ts"] | app.lastSyncTs;
    hasMore = doc["has_more"] | false;
    nextCursor = String(doc["next_cursor"] | "");
    JsonArray events = doc["events"].as<JsonArray>();

    if (!appendEvents(events)) {
      hasMore = false;
      setStatus("Showing first 96 events", true);
    }

    ++pageCount;
  } while (hasMore && nextCursor.length() > 0 && pageCount < 10 && app.eventCount < APP_EVENT_CAPACITY);

  app.lastRefreshMs = millis();
  const time_t now = time(nullptr);
  if (now >= 1700000000) {
    app.lastRenderMinuteTs = now - (now % 60);
  }
  app.fetchInProgress = false;
  if (app.eventCount == 0) {
    setStatus("No upcoming events", true);
  } else {
    setStatus("", false);
  }
  setRefreshOverlay("", false);
  return true;
}

bool triggerDaemonRefresh() {
  if (!app.wifiReady) {
    setStatus("Wi-Fi offline", true);
    setRefreshOverlay("", false);
    return false;
  }

  WiFiClient client;
  HTTPClient http;
  http.setConnectTimeout(8000);
  http.setTimeout(20000);

  const String url = String(APP_DAEMON_URL) + "/v1/refresh";
  if (!http.begin(client, url)) {
    setStatus("Refresh setup failed", true);
    setRefreshOverlay("", false);
    return false;
  }

  http.addHeader("Authorization", String("Bearer ") + APP_API_TOKEN);
  const int httpCode = http.POST("");
  if (httpCode != HTTP_CODE_OK) {
    const String errorText = http.errorToString(httpCode);
    http.end();
    setStatus("Refresh failed: " + errorText, true);
    setRefreshOverlay("", false);
    return false;
  }

  http.end();
  return true;
}

