fasmide/esp32_calthing/esp32ui/src/main.cpp
void addDaySection(lv_obj_t *parent, time_t dayStart) {
  lv_obj_t *section = lv_obj_create(parent);
  lv_obj_add_style(section, &style_day_panel, LV_PART_MAIN);
  lv_obj_set_width(section, lv_pct(100));
  lv_obj_set_height(section, LV_SIZE_CONTENT);
  lv_obj_set_layout(section, LV_LAYOUT_FLEX);
  lv_obj_set_flex_flow(section, LV_FLEX_FLOW_COLUMN);
  lv_obj_set_style_pad_gap(section, 6, 0);

  lv_obj_t *title = lv_label_create(section);
  lv_obj_set_style_text_font(title, &app_font_24, 0);
  lv_obj_set_style_text_color(title, lv_color_hex(0xF7FBFF), 0);
  lv_label_set_text(title, formatDayTitle(dayStart).c_str());

  lv_obj_t *subtitle = lv_label_create(section);
  lv_obj_set_style_text_font(subtitle, &app_font_14, 0);
  lv_obj_set_style_text_color(subtitle, lv_color_hex(0x9EB1CB), 0);
  lv_label_set_text(subtitle, formatDaySubtitle(dayStart).c_str());

  bool foundEvents = false;
  const time_t dayEnd = dayStart + 24 * 60 * 60;
  for (int i = 0; i < app.eventCount; ++i) {
    const CalendarEvent &event = app.events[i];
    if (event.endTs <= dayStart || event.startTs >= dayEnd) {
      continue;
    }

    foundEvents = true;
    lv_obj_t *button = lv_button_create(section);
    lv_obj_add_style(button, &style_event_card, LV_PART_MAIN);
    lv_obj_remove_flag(button, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_flag(button, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(button, onEventPressed, LV_EVENT_CLICKED, &app.events[i]);
    lv_obj_set_width(button, lv_pct(100));
    lv_obj_set_height(button, LV_SIZE_CONTENT);

    lv_obj_set_layout(button, LV_LAYOUT_FLEX);
    lv_obj_set_flex_flow(button, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_style_pad_gap(button, 4, 0);

    lv_obj_t *metaRow = lv_obj_create(button);
    lv_obj_remove_style_all(metaRow);
    lv_obj_set_width(metaRow, lv_pct(100));
    lv_obj_set_height(metaRow, LV_SIZE_CONTENT);
    lv_obj_set_layout(metaRow, LV_LAYOUT_FLEX);
    lv_obj_set_flex_flow(metaRow, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(metaRow, LV_FLEX_ALIGN_SPACE_BETWEEN, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

    lv_obj_t *timeLabel = lv_label_create(metaRow);
    lv_obj_set_style_text_font(timeLabel, &app_font_16, 0);
    lv_obj_set_style_text_color(timeLabel, lv_color_hex(0xFFD166), 0);
    lv_label_set_text(timeLabel, formatTimeRange(event).c_str());

    const EventTimingState timingState = getEventTimingState(event);
    const String relative = formatEventStatus(event);
    if (!relative.isEmpty()) {
      lv_obj_t *relativeLabel = lv_label_create(metaRow);
      lv_obj_set_style_text_font(relativeLabel, &app_font_16, 0);
      lv_obj_set_style_text_color(relativeLabel, getEventTimingColor(timingState), 0);
      lv_label_set_text(relativeLabel, relative.c_str());
    }

    lv_obj_t *titleLabel = lv_label_create(button);
    lv_obj_set_style_text_font(titleLabel, &app_font_20, 0);
    lv_obj_set_style_text_color(titleLabel, lv_color_hex(0xF4F7FB), 0);
    lv_label_set_long_mode(titleLabel, LV_LABEL_LONG_WRAP);
    lv_obj_set_width(titleLabel, lv_pct(100));
    lv_label_set_text(titleLabel, event.title.c_str());

    if (!event.location.isEmpty()) {
      lv_obj_t *locationLabel = lv_label_create(button);
      lv_obj_set_style_text_font(locationLabel, &app_font_14, 0);
      lv_obj_set_style_text_color(locationLabel, lv_color_hex(0xAFC0D8), 0);
      lv_label_set_long_mode(locationLabel, LV_LABEL_LONG_WRAP);
      lv_obj_set_width(locationLabel, lv_pct(100));
      lv_label_set_text(locationLabel, event.location.c_str());
    }
  }

  if (!foundEvents) {
    lv_obj_t *emptyLabel = lv_label_create(section);
    lv_obj_set_style_text_font(emptyLabel, &app_font_16, 0);
    lv_obj_set_style_text_color(emptyLabel, lv_color_hex(0x8EA2BE), 0);
    lv_label_set_text(emptyLabel, "No events");
  }
}

void rebuildAgenda(bool preserveView = false) {
  if (agenda_panel == nullptr) {
    return;
  }

  const lv_coord_t preservedScrollY = preserveView ? lv_obj_get_scroll_y(agenda_panel) : 0;
  const bool detailWasOpen = preserveView && detail_overlay != nullptr && !lv_obj_has_flag(detail_overlay, LV_OBJ_FLAG_HIDDEN);
  const String detailEventId = app.openDetailEventId;

  hideDetailOverlay();
  lv_obj_clean(agenda_panel);

  if (!hasAppConfig()) {
    lv_obj_t *label = lv_label_create(agenda_panel);
    lv_obj_set_width(label, lv_pct(100));
    lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_font(label, &app_font_20, 0);
    lv_label_set_text(label, "Set Wi-Fi, daemon URL and API token in app_config.h");
    return;
  }

  for (time_t day = app.rangeStart; day < app.rangeEnd; day += 24 * 60 * 60) {
    addDaySection(agenda_panel, day);
  }

  if (preserveView) {
    lv_obj_scroll_to_y(agenda_panel, preservedScrollY, LV_ANIM_OFF);
  } else {
    lv_obj_scroll_to_y(agenda_panel, 0, LV_ANIM_OFF);
  }

  if (detailWasOpen && !detailEventId.isEmpty()) {
    for (int i = 0; i < app.eventCount; ++i) {
      if (app.events[i].id == detailEventId) {
        showDetailOverlay(app.events[i]);
        break;
      }
    }
  }

  updateBackButtonVisibility();
}

void updateRelativeTimesIfNeeded() {
  if (app.eventCount == 0) {
    return;
  }

  const time_t now = time(nullptr);
  if (now < 1700000000) {
    return;
  }

  const time_t currentMinuteTs = now - (now % 60);
  if (app.lastRenderMinuteTs == currentMinuteTs) {
    return;
  }

  app.lastRenderMinuteTs = currentMinuteTs;
  rebuildAgenda(true);
}

void buildUi() {
  initStyles();

  lv_obj_t *screen = lv_screen_active();
  lv_obj_add_style(screen, &style_screen, LV_PART_MAIN);
  lv_obj_set_style_pad_all(screen, 0, 0);

  agenda_panel = lv_obj_create(screen);
  lv_obj_add_flag(agenda_panel, LV_OBJ_FLAG_SCROLL_ELASTIC);
  lv_obj_set_size(agenda_panel, lv_pct(100), lv_pct(100));
  lv_obj_set_style_pad_all(agenda_panel, 14, 0);
  lv_obj_set_style_pad_gap(agenda_panel, 12, 0);
  lv_obj_set_style_bg_opa(agenda_panel, LV_OPA_TRANSP, 0);
  lv_obj_set_style_border_width(agenda_panel, 0, 0);
  lv_obj_set_layout(agenda_panel, LV_LAYOUT_FLEX);
  lv_obj_set_flex_flow(agenda_panel, LV_FLEX_FLOW_COLUMN);
  lv_obj_set_scrollbar_mode(agenda_panel, LV_SCROLLBAR_MODE_OFF);
  lv_obj_add_event_cb(agenda_panel, onAgendaScrolled, LV_EVENT_SCROLL, nullptr);
  lv_obj_add_event_cb(agenda_panel, onAgendaScrollEnd, LV_EVENT_SCROLL_END, nullptr);

