fasmide/esp32_calthing/esp32ui/src/main.cpp
  if (!gfx->begin()) {
    Serial.println("gfx->begin() failed");
  }

  pinMode(GFX_BL, OUTPUT);
  analogWrite(GFX_BL, TFT_BRIGHTNESS);

  gfx->displayOn();
  gfx->fillScreen(BLACK);
  gfx->setRotation((4 - TFT_ROTATION) % 4);
}

void setupLvgl() {
  lv_init();
  lv_tick_set_cb(my_tick);

  lv_display_t *disp = lv_display_create(TFT_HOR_RES, TFT_VER_RES);
  lv_display_set_flush_cb(disp, my_disp_flush);
  lv_display_set_buffers(disp, draw_buf, nullptr, sizeof(draw_buf), LV_DISPLAY_RENDER_MODE_PARTIAL);
  lv_display_set_rotation(disp, TFT_ROTATION);

  lv_indev_t *indev = lv_indev_create();
  lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);
  lv_indev_set_read_cb(indev, my_touchpad_read);
}

void setup() {
  Serial.begin(115200);
  Serial.println("Starting agenda UI");

  setupDisplay();
  setupLvgl();

  app.rangeStart = startOfLocalDay(time(nullptr));
  app.rangeEnd = app.rangeStart + (APP_QUERY_DAYS * 24 * 60 * 60);

  buildUi();
  connectWifi();
  refreshIfNeeded();
}

void loop() {
#if APP_PROFILE_RENDER
  const unsigned long lvHandlerStartedAt = micros();
#endif
  lv_timer_handler();
#if APP_PROFILE_RENDER
  const uint32_t lvHandlerElapsedUs = micros() - lvHandlerStartedAt;
  renderProfile.loopCount++;
  renderProfile.totalLvHandlerUs += lvHandlerElapsedUs;
  if (lvHandlerElapsedUs > renderProfile.maxLvHandlerUs) {
    renderProfile.maxLvHandlerUs = lvHandlerElapsedUs;
  }
#endif
  // Flush once per loop to batch cache writeback instead of flushing every
  // partial draw operation.
  gfx->flush();
  refreshIfNeeded();
  updateRelativeTimesIfNeeded();
#if APP_PROFILE_RENDER
  reportRenderProfileIfNeeded();
#endif
  delay(5);
}
